{
  "HEADER": {
    "signin": "Sign In",
    "signup": "Sign Up",
    "signout": "Sign Out"
  },
  "MAIN_AUTH": {
    "greeting": "Welcome Back, {userName}!",
    "restful_link": "REST Client",
    "graphql_link": "GraphQL Client",
    "history_link": "History"
  },
  "MAIN_UNAUTH": {
    "greeting": "Welcome to API Nexus",
    "descr": "A powerful tool for testing and interacting with your APIs. Please sign in or register to continue.",
    "signin_link": "Sign In",
    "signup_link": "Sign Up"
  },
  "MAIN": {
    "project_title": "About the project",
    "project": "API Nexus is an intuitive tool that allows you to easily test and interact with your APIs. Our application provides a user-friendly interface for sending requests, viewing responses, and managing APIs.",
    "team_title": "Our team",
    "course_title": "About the course",
    "course_1": "This project is part of the ReactJS course from RS School",
    "course_2": ". The course covers all the key aspects of React application development and helps students apply the acquired knowledge in practice through real projects",
    "course_link": " ReactJS from RS School"
  },
  "SIGN_IN": {
    "title": "Sign in to your account",
    "signin_btn": "Sign in",
    "signup_link": "Sign up",
    "descr": "Don’t have an account yet?",
    "email_label": "Email",
    "psw_label": "Password",
    "login_duration": "You will stay signed in for {sessionDurationHours, plural, =1 {1 hour} other {# hours}}. Please log in again after this time expires.",
    "remember_label": "Remember me",
    "forgot_psw": "Forgot password?"
  },
  "SIGN_UP": {
    "title": "Sign up for an account",
    "signup_btn": "Sign up",
    "signin_link": "Sign in",
    "descr": "Already have an account?",
    "username_label": "Username",
    "email_label": "Email",
    "psw_label": "Password",
    "confirm_psw_label": "Confirm Password"
  },
  "RESTFUL_CLIENT": {
    "title": "RESTful Client",
    "description": "Explore and interact with RESTful APIs."
  },
  "GRAPHQL_CLIENT": {
    "title": "GraphQL Client",
    "description": "Explore and interact with GraphQL APIs."
  },
  "HISTORY": {
    "title": "History",
    "description": "View the history of your interactions and changes."
  },
  "NOT_FOUND": {
    "title": "404 - Not Found",
    "message": "Sorry, we couldn`t find the page you were looking for.",
    "link_to_main": "Go to main page"
  },
  "TEAM": {
    "valeriya": {
      "name": "Valeriya Tikhonova",
      "role": "Front-end Developer",
      "bio": "My name is Valeria and I am a beginner frontend developer who strives to create beautiful and functional web applications. I am passionate about web development and constantly develop my skills in working with modern technologies. At the moment, I am actively studying: HTML, CSS, JavaScript and React. I am always open to new challenges and opportunities to grow as a developer and bring value to the team."
    },
    "ana": {
      "name": "Ana Tvaliashvili",
      "role": "Team Lead / Front-end Developer",
      "bio": "Greetings! I am a motivated tech enthusiast transitioning into a career in technology, currently enrolled in courses at RSSchool in front-end development and AWS Cloud Developer training. With a strong commitment to self-development, I am eager to leverage my skills and knowledge in tech to drive innovative solutions and contribute to impactful projects."
    },
    "alex": {
      "name": "Alexandra Paramonova",
      "role": "Front-end Developer",
      "bio": "Hi! I am a beginner front-end developer with a keen interest in building engaging and user-friendly web applications. I&apos;m excited to apply my skills to real-world projects, collaborate with others and take on new challenges in the field. I&apos;m grateful for the opportunity to learn from RS School, which has given me a strong foundation in HTML, CSS, and JavaScript!"
    }
  },
  "VALIDATION": {
    "user-name-min-length": "UserName must be at least 3 characters long.",
    "email-invalid": "Please enter a valid email.",
    "password-min-length": "Password must be at least 8 characters long.",
    "password-must-contain-letter": "Contain at least one letter.",
    "password-must-contain-digit": "Contain at least one digit.",
    "password-must-contain-special": "Contain at least one special character.",
    "passwords-must-match": "Passwords do not match."
  },
  "ERRORS": {
    "app/unknown-error": "An unexpected error occurred{errorCode}. Please try again.",
    "auth/email-already-exists": "This email is already in use. Please use a different email address.",
    "auth/invalid-email": "Invalid email format. Please enter a valid email address.",
    "auth/invalid-password": "Invalid password. Your password must be at least six characters long.",
    "auth/wrong-password": "Incorrect password. Please try again.",
    "auth/invalid-display-name": "Invalid name. Name must be a non-empty string.",
    "auth/invalid-session-cookie-duration": "Session duration is out of range. It must be between 5 minutes and 2 weeks.",
    "auth/invalid-uid": "User ID must be a non-empty string with a maximum of 128 characters.",
    "auth/missing-uid": "User ID is required to complete this operation.",
    "auth/session-cookie-expired": "Your session has expired. Please log in again.",
    "auth/session-cookie-revoked": "Your session has been revoked. Please log in again.",
    "auth/uid-already-exists": "This user ID is already in use. Please use a different one.",
    "auth/timeout": "The operation timed out. Please try again.",
    "auth/user-token-expired": "Your session has expired. Please sign in again.",
    "auth/user-not-found": "No user found with this information. The account may have been deleted.",
    "auth/weak-password": "Your password is too weak. It must be at least 6 characters long.",
    "auth/id-token-expired": "Your session has expired. Please sign in again.",
    "auth/id-token-revoked": "Your session has been revoked. Please sign in again.",
    "auth/insufficient-permission": "Insufficient permissions to perform this action. Please check your credentials.",
    "auth/invalid-argument": "There was an issue with the provided information. Please check and try again.",
    "auth/invalid-id-token": "The provided session token is invalid. Please log in again.",
    "auth/invalid-last-sign-in-time": "Last sign-in time is not in a valid format.",
    "auth/invalid-page-token": "Invalid page token. Please provide a valid token.",
    "auth/project-not-found": "No project found. Please check your credentials and try again.",
    "auth/admin-restricted-operation": "This action is restricted to administrators.",
    "auth/app-not-authorized": "This app is not authorized to use Firebase Authentication. Please check your API key settings.",
    "auth/app-not-installed": "The required mobile app is not installed on this device.",
    "auth/cors-unsupported": "Your browser does not support this action.",
    "auth/credential-already-in-use": "This credential is already linked to another account.",
    "auth/custom-token-mismatch": "The provided custom token does not match the expected audience.",
    "auth/requires-recent-login": "For security reasons, please log in again to complete this action.",
    "auth/dependent-sdk-initialized-before-auth": "Please initialize Firebase Authentication before using other Firebase services.",
    "auth/email-already-in-use": "This email is already associated with another account.",
    "auth/emulator-config-failed": "Unable to configure the emulator after making a network request. Please call 'connectAuthEmulator()' earlier.",
    "auth/expired-action-code": "The link has expired. Please request a new one.",
    "auth/internal-error": "An unexpected error occurred. Please try again later.",
    "auth/invalid-app-id": "The app ID is not registered with this project.",
    "auth/invalid-user-token": "Your credentials are not valid for this project. Please sign in again.",
    "auth/invalid-auth-event": "An error occurred during authentication.",
    "auth/invalid-api-key": "Invalid API key. Please check your configuration.",
    "auth/invalid-cert-hash": "The provided certificate hash is invalid.",
    "auth/invalid-credential": "Your credentials are invalid or expired. Please check and try again.",
    "auth/invalid-message-payload": "The email message contains invalid characters. Please update the email template.",
    "auth/unauthorized-domain": "This domain is not authorized for this operation. Please check your domain settings.",
    "auth/invalid-action-code": "The action code is invalid or expired.",
    "auth/invalid-persistence-type": "Invalid persistence type. It must be 'local', 'session', or 'none'.",
    "auth/invalid-provider-id": "The provider ID is invalid.",
    "auth/invalid-recipient-email": "The recipient email address is invalid.",
    "auth/invalid-sender": "The sender's email or name is invalid. Please update the email template.",
    "auth/auth-domain-config-required": "Authentication domain is missing in your app's configuration.",
    "auth/app-deleted": "This Firebase app instance has been deleted.",
    "auth/account-exists-with-different-credential": "An account already exists with this email address but different sign-in credentials. Please sign in using the correct provider.",
    "auth/network-request-failed": "A network error occurred. Please check your connection and try again.",
    "auth/no-auth-event": "An unexpected error occurred during authentication.",
    "auth/no-such-provider": "No account found with the provided provider.",
    "auth/null-user": "The user is not logged in. Please log in and try again.",
    "auth/operation-not-allowed": "This sign-in method is not enabled. Please check your settings.",
    "auth/operation-not-supported-in-this-environment": "This operation is not supported in your current environment. Make sure you're using a supported protocol.",
    "auth/quota-exceeded": "You have exceeded the quota for this operation. Please try again later.",
    "auth/redirect-cancelled-by-user": "The sign-in process was canceled. Please try again.",
    "auth/redirect-operation-pending": "A sign-in operation is already in progress. Please wait or complete it.",
    "auth/rejected-credential": "The credentials provided were rejected. Please try again.",
    "auth/too-many-requests": "Too many login attempts. Please try again later.",
    "auth/claims-too-large": "The data you provided for user claims is too large. Please ensure it doesn't exceed 1000 bytes.",
    "auth/invalid-claims": "The custom claims you provided are not valid. Please check the format and values.",
    "auth/invalid-creation-time": "The creation time must be a valid date in UTC format.",
    "auth/invalid-disabled-field": "The 'disabled' field must be a true or false value.",
    "auth/invalid-email-verified": "The 'emailVerified' field must be a true or false value.",
    "auth/invalid-hash-algorithm": "The hash algorithm must be one of the supported types.",
    "auth/invalid-hash-block-size": "The block size for the hash must be a valid number.",
    "auth/invalid-hash-derived-key-length": "The key length for the hash must be a valid number.",
    "auth/invalid-hash-key": "The hash key must be a valid byte buffer.",
    "auth/invalid-hash-memory-cost": "The memory cost for the hash must be a valid number.",
    "auth/invalid-hash-parallelization": "The parallelization factor for the hash must be a valid number.",
    "auth/invalid-hash-rounds": "The number of rounds for the hash must be a valid number.",
    "auth/invalid-hash-salt-separator": "The salt separator for the hash must be a valid byte buffer.",
    "auth/invalid-password-hash": "The password hash must be a valid byte buffer.",
    "auth/invalid-password-salt": "The password salt must be a valid byte buffer.",
    "auth/invalid-photo-url": "The photo URL you provided is not valid. It must be a proper URL format.",
    "auth/invalid-provider-data": "The provider data must be a valid list of user information objects.",
    "auth/invalid-oauth-responsetype": "You should set only one OAuth response type to true.",
    "auth/invalid-user-import": "The user record you are trying to import is not valid.",
    "auth/maximum-user-count-exceeded": "You have exceeded the maximum number of users allowed for import.",
    "auth/missing-hash-algorithm": "You need to provide a hashing algorithm and its parameters to import users with password hashes.",
    "auth/missing-oauth-client-secret": "You need to provide the OAuth client secret to enable OIDC code flow.",
    "auth/phone-number-already-exists": "The phone number is already associated with another user. Each phone number must be unique.",
    "auth/reserved-claims": "Some custom claims you provided are reserved for system use. Avoid using OIDC-specific claims as custom keys.",
    "auth/captcha-check-failed": "The reCAPTCHA token is invalid, expired, or the domain does not match the allowed domains.",
    "auth/code-expired": "The verification code has expired. Please request a new code and try again.",
    "auth/cordova-not-ready": "The Cordova framework is not yet ready.",
    "auth/dynamic-link-not-activated": "Please activate Dynamic Links in the Firebase Console and agree to the terms and conditions.",
    "auth/email-change-needs-verification": "Users with multi-factor authentication must have a verified email.",
    "auth/cancelled-popup-request": "The operation was canceled because another popup was opened.",
    "auth/invalid-app-credential": "The phone verification request has an invalid application verifier or the reCAPTCHA token is invalid or expired.",
    "auth/invalid-verification-code": "The SMS verification code is incorrect or expired. Please resend the code and make sure to use the correct one.",
    "auth/invalid-continue-uri": "The continue URL provided is not valid.",
    "auth/invalid-cordova-configuration": "Please install the required Cordova plugins for OAuth sign-in: cordova-plugin-buildinfo, cordova-universal-links-plugin, cordova-plugin-browsertab, cordova-plugin-inappbrowser, and cordova-plugin-customurlscheme.",
    "auth/invalid-custom-token": "The custom token is in an incorrect format. Please refer to the documentation for proper formatting.",
    "auth/invalid-dynamic-link-domain": "The dynamic link domain you provided is not set up or authorized for your project.",
    "auth/invalid-emulator-scheme": "The emulator URL must start with 'http://' or 'https://'.",
    "auth/invalid-multi-factor-session": "You need to provide proof of successful sign-in with the first factor.",
    "auth/invalid-oauth-provider": "Only OAuth providers are supported for this operation. EmailAuthProvider is not supported.",
    "auth/invalid-oauth-client-id": "The OAuth client ID is invalid or does not match the API key.",
    "auth/invalid-phone-number": "The phone number format is incorrect. Please use the E.164 format: [+][country code][subscriber number].",
    "auth/invalid-verification-id": "The verification ID used is invalid.",
    "auth/invalid-tenant-id": "The tenant ID for the Auth instance is not valid.",
    "auth/missing-android-pkg-name": "An Android Package Name is required if the app must be installed.",
    "auth/missing-app-credential": "The phone verification request is missing an application verifier. Please provide a reCAPTCHA token.",
    "auth/missing-verification-code": "The phone auth credential was created without a verification code.",
    "auth/missing-continue-uri": "A continue URL is required in the request.",
    "auth/missing-iframe-start": "An internal error has occurred.",
    "auth/missing-ios-bundle-id": "An iOS Bundle ID is required if an App Store ID is provided.",
    "auth/missing-or-invalid-nonce": "The request is missing or has an invalid nonce. Ensure the nonce matches the hashed nonce in the ID token.",
    "auth/missing-multi-factor-info": "You need to provide information for the second authentication factor.",
    "auth/missing-multi-factor-session": "Proof of successful sign-in with the first factor is missing.",
    "auth/missing-phone-number": "Please provide a phone number to send verification codes.",
    "auth/missing-verification-id": "The phone auth credential was created without a verification ID.",
    "auth/multi-factor-info-not-found": "No matching second factor found for the provided identifier.",
    "auth/multi-factor-auth-required": "You need to verify ownership of a second factor to complete sign-in.",
    "auth/popup-blocked": "The popup could not be opened. It may have been blocked by your browser.",
    "auth/popup-closed-by-user": "The popup was closed before completing the operation.",
    "auth/provider-already-linked": "The user can only be linked to one identity for this provider.",
    "auth/second-factor-already-in-use": "This second factor is already linked to the account.",
    "auth/maximum-second-factor-count-exceeded": "The maximum number of second factors for a user has been exceeded.",
    "auth/tenant-id-mismatch": "The tenant ID provided does not match the Auth instance's tenant ID.",
    "auth/unauthorized-continue-uri": "The domain of the continue URL is not allowed. Please add it to the whitelist in the Firebase console.",
    "auth/unsupported-first-factor": "You must sign in with a supported first factor before adding a second factor or using multi-factor sign-in.",
    "auth/unsupported-persistence-type": "The specified persistence type is not supported in the current environment.",
    "auth/unsupported-tenant-operation": "This operation is not supported in a multi-tenant setup.",
    "auth/unverified-email": "A verified email is required to complete this operation.",
    "auth/user-cancelled": "The user did not grant the necessary permissions to your application.",
    "auth/user-disabled": "The user account has been disabled by an administrator.",
    "auth/user-mismatch": "The credentials provided do not match the signed-in user.",
    "auth/web-storage-unsupported": "Your browser does not support web storage or third-party cookies may be disabled.",
    "auth/already-initialized": "initializeAuth() has been called with different options. Please use the same options or call getAuth() to use the existing instance."
  }
}
