{
  "HEADER": {
    "signin": "Войти",
    "signup": "Зарегистрироваться"
  },
  "MAIN_AUTH": {
    "greeting": "С возвращением, ",
    "restfull_link": "REST-клиент",
    "graphiql_link": "GraphiQL-клиент",
    "history_link": "История"
  },
  "MAIN_UNAUTH": {
    "greeting": "Добро пожаловать в API Nexus",
    "descr": "Мощный инструмент для тестирования и взаимодействия с вашими API.",
    "signin_link": "Войти",
    "signup_link": "Зарегистрироваться"
  },
  "MAIN": {
    "project_title": "О проекте",
    "project": "API Nexus - это интуитивно понятный инструмент, который позволяет вам легко тестировать и взаимодействовать с вашими API. Наше приложение предоставляет удобный интерфейс для отправки запросов, просмотра ответов и управления API.",
    "team_title": "OНаша команда",
    "course_title": "О курсе",
    "course_1": "Этот проект является частью курса ReactJS от RS School",
    "course_2": ". Курс охватывает все ключевые аспекты разработки приложений на React и помогает студентам применить полученные знания на практике через реальные проекты",
    "course_link": " ReactJS от RS School"
  },
  "SIGN_IN": {
    "title": "Войти в учетную запись",
    "signin_btn": "Войти",
    "signup_link": "Зарегистрироваться",
    "descr": "Ещё нет аккаунта?",
    "email_label": "Email адрес",
    "psw_label": "Пароль",
    "remember_label": "Запомнить меня",
    "forgot_psw": "Забыли пароль?"
  },
  "SIGN_UP": {
    "title": "Создать аккаунт",
    "signup_btn": "Зарегистрироваться",
    "signin_link": "Войти",
    "descr": "Уже есть аккаунт?",
    "fname_label": "Имя",
    "lname_label": "Фамилия",
    "email_label": "Email адрес",
    "psw_label": "Пароль",
    "confirm_psw_label": "Подтвердить пароль"
  },
  "REST_CLIENT": {
    "title": "RESTfull клиент"
  },
  "GRAPHI_CLIENT": {
    "title": "GraphiQL клиент"
  },
  "HISTORY": {
    "title": "История"
  },
  "NOT_FOUND": {
    "title": "404 - Странице не найдена",
    "message": "Простите, мы не смогли найти данную страницу.",
    "link_to_main": "На главную страницу"
  },
  "TEAM": {
    "valeriya": {
      "name": "Валерия Тихонова",
      "role": "Front-end разработчик",
      "bio": "Меня зовут Валерия, я начинающий фронтенд-разработчик, который стремится создавать красивые и функциональные веб-приложения. Я увлечена веб-разработкой и постоянно развиваю свои навыки работы с современными технологиями. На данный момент я активно изучаю: HTML, CSS, JavaScript и React. Я всегда открыта для новых вызовов и возможностей расти как разработчик и приносить пользу команде."
    },
    "ana": {
      "name": "Ана Твалиашвили",
      "role": "Тимлид / Front-end разработчик",
      "bio": "Приветствую! Я целеустремленный энтузиаст, начинающий карьеру в сфере технологий, в настоящее время прохожу курсы в RSSchool по фронтенд-разработке и AWS Cloud Developer. Стремясь к саморазвитию, я хочу использовать свои навыки и знания в области технологий для разработки инновационных решений и участия в значимых проектах."
    },
    "alex": {
      "name": "Александра Парамонова",
      "role": "Front-end разработчик",
      "bio": "Привет! Я начинающий фронтенд-разработчик с большим интересом к созданию привлекательных и удобных веб-приложений. Я с нетерпением жду возможности применить свои навыки в реальных проектах, сотрудничать с другими людьми и решать новые задачи в этой области. Я благодарна за возможность учиться в RS School, которая дала мне прочный фундамент в HTML, CSS и JavaScript!"
    }
  }
}
