{
  "HEADER": {
    "signin": "Войти",
    "signup": "Зарегистрироваться",
    "signout": "Выйти"
  },
  "MAIN_AUTH": {
    "greeting": "С возвращением, {userName}!",
    "restful_link": "REST-клиент",
    "graphql_link": "GraphQL-клиент",
    "history_link": "История"
  },
  "MAIN_UNAUTH": {
    "greeting": "Добро пожаловать в API Nexus",
    "descr": "Мощный инструмент для тестирования и взаимодействия с вашими API. Пожалуйста, войдите или зарегистрируйтесь, чтобы продолжить.",
    "signin_link": "Войти",
    "signup_link": "Зарегистрироваться"
  },
  "MAIN": {
    "project_title": "О проекте",
    "project": "API Nexus - это интуитивно понятный инструмент, который позволяет вам легко тестировать и взаимодействовать с вашими API. Наше приложение предоставляет удобный интерфейс для отправки запросов, просмотра ответов и управления API.",
    "team_title": "Наша команда",
    "course_title": "О курсе",
    "course_1": "Этот проект является частью курса ReactJS от RS School",
    "course_2": ". Курс охватывает все ключевые аспекты разработки приложений на React и помогает студентам применить полученные знания на практике через реальные проекты",
    "course_link": " ReactJS от RS School"
  },
  "SIGN_IN": {
    "title": "Войти в учетную запись",
    "signin_btn": "Войти",
    "signup_link": "Зарегистрироваться",
    "descr": "Ещё нет аккаунта?",
    "email_label": "Email адрес",
    "psw_label": "Пароль",
    "login_duration": "Вход действует {sessionDurationHours, plural, one {# час} few {# часа} many {# часов}}. Пожалуйста, войдите снова по истечении этого времени.",
    "remember_label": "Запомнить меня",
    "forgot_psw": "Забыли пароль?"
  },
  "SIGN_UP": {
    "title": "Создать аккаунт",
    "signup_btn": "Зарегистрироваться",
    "signin_link": "Войти",
    "descr": "Уже есть аккаунт?",
    "username_label": "Имя пользователя",
    "email_label": "Email адрес",
    "psw_label": "Пароль",
    "confirm_psw_label": "Подтвердить пароль"
  },
  "RESTFUL_CLIENT": {
    "title": "RESTful Клиент",
    "description": "Изучайте и взаимодействуйте с RESTful API."
  },
  "GRAPHQL_CLIENT": {
    "title": "GraphQL Клиент",
    "description": "Изучайте и взаимодействуйте с GraphQL API."
  },
  "HISTORY": {
    "title": "История",
    "description": "Просматривайте историю ваших взаимодействий и изменений."
  },
  "NOT_FOUND": {
    "title": "404 - Странице не найдена",
    "message": "Простите, мы не смогли найти данную страницу.",
    "link_to_main": "На главную страницу"
  },
  "TEAM": {
    "valeriya": {
      "name": "Валерия Тихонова",
      "role": "Front-end разработчик",
      "bio": "Меня зовут Валерия, я начинающий фронтенд-разработчик, который стремится создавать красивые и функциональные веб-приложения. Я увлечена веб-разработкой и постоянно развиваю свои навыки работы с современными технологиями. На данный момент я активно изучаю: HTML, CSS, JavaScript и React. Я всегда открыта для новых вызовов и возможностей расти как разработчик и приносить пользу команде."
    },
    "ana": {
      "name": "Ана Твалиашвили",
      "role": "Тимлид / Front-end разработчик",
      "bio": "Приветствую! Я целеустремленный энтузиаст, начинающий карьеру в сфере технологий, в настоящее время прохожу курсы в RSSchool по фронтенд-разработке и AWS Cloud Developer. Стремясь к саморазвитию, я хочу использовать свои навыки и знания в области технологий для разработки инновационных решений и участия в значимых проектах."
    },
    "alex": {
      "name": "Александра Парамонова",
      "role": "Front-end разработчик",
      "bio": "Привет! Я начинающий фронтенд-разработчик с большим интересом к созданию привлекательных и удобных веб-приложений. Я с нетерпением жду возможности применить свои навыки в реальных проектах, сотрудничать с другими людьми и решать новые задачи в этой области. Я благодарна за возможность учиться в RS School, которая дала мне прочный фундамент в HTML, CSS и JavaScript!"
    }
  },
  "VALIDATION": {
    "user-name-min-length": "Имя пользователя должно содержать не менее 3 символов.",
    "email-invalid": "Пожалуйста, введите действительный email адрес.",
    "password-min-length": "Пароль должен быть не менее 8 символов.",
    "password-must-contain-letter": "Содержать хотя бы одну букву.",
    "password-must-contain-digit": "Содержать хотя бы одну цифру.",
    "password-must-contain-special": "Содержать хотя бы один специальный символ.",
    "passwords-must-match": "Пароли не совпадают."
  },
  "ERRORS": {
    "app/unknown-error": "Произошла непредвиденная ошибка{errorCode}. Пожалуйста, попробуйте снова.",
    "auth/email-already-exists": "Этот email уже используется другим пользователем. Пожалуйста, используйте другой email.",
    "auth/invalid-email": "Неверный формат email. Пожалуйста, введите корректный адрес электронной почты.",
    "auth/invalid-password": "Неверный пароль. Пароль должен содержать не менее шести символов.",
    "auth/wrong-password": "Неверный пароль. Пожалуйста, попробуйте снова.",
    "auth/invalid-display-name": "Неверное значение имени. Пожалуйста, введите корректное имя.",
    "auth/invalid-session-cookie-duration": "Длительность сессионной куки должна быть числом в миллисекундах между 5 минутами и 2 неделями.",
    "auth/invalid-uid": "UID должен быть непустой строкой с максимум 128 символами.",
    "auth/missing-uid": "Для выполнения операции требуется UID идентификатор.",
    "auth/session-cookie-expired": "Ваша сессионная куки истекла. Пожалуйста, войдите снова.",
    "auth/session-cookie-revoked": "Ваша сессионная куки была аннулирована. Пожалуйста, войдите снова.",
    "auth/uid-already-exists": "Этот UID уже используется другим пользователем. Пожалуйста, используйте другой UID.",
    "auth/timeout": "Операция завершилась тайм-аутом. Пожалуйста, попробуйте снова.",
    "auth/user-token-expired": "Ваши учетные данные истекли. Пожалуйста, войдите снова.",
    "auth/user-not-found": "Пользователь с этим идентификатором не найден. Возможно, аккаунт был удален.",
    "auth/weak-password": "Пароль слишком слабый. Он должен содержать не менее 6 символов.",
    "auth/id-token-expired": "Ваш токен истек. Пожалуйста, войдите снова.",
    "auth/id-token-revoked": "Ваш токен был аннулирован. Пожалуйста, войдите снова.",
    "auth/insufficient-permission": "Недостаточно прав для выполнения этой операции. Проверьте свои учетные данные.",
    "auth/invalid-argument": "Передан неверный аргумент. Проверьте данные и попробуйте снова.",
    "auth/invalid-id-token": "Переданный токен недействителен. Пожалуйста, войдите снова.",
    "auth/invalid-last-sign-in-time": "Время последнего входа должно быть в формате UTC.",
    "auth/invalid-page-token": "Неверный токен страницы. Пожалуйста, предоставьте корректный токен.",
    "auth/project-not-found": "Не найден проект для используемых учетных данных. Проверьте свои настройки.",
    "auth/admin-restricted-operation": "Эта операция доступна только администраторам.",
    "auth/app-not-authorized": "Это приложение не авторизовано использовать Firebase Authentication с предоставленным API-ключом. Проверьте настройки ключа.",
    "auth/app-not-installed": "Запрашиваемое мобильное приложение не установлено на этом устройстве.",
    "auth/cors-unsupported": "Этот браузер не поддерживается.",
    "auth/credential-already-in-use": "Эти учетные данные уже связаны с другой учетной записью.",
    "auth/custom-token-mismatch": "Предоставленный кастомный токен не соответствует ожидаемой аудитории.",
    "auth/requires-recent-login": "Для этой операции требуется недавняя аутентификация. Войдите снова перед повторной попыткой.",
    "auth/dependent-sdk-initialized-before-auth": "Другой SDK Firebase был инициализирован до инициализации Auth. Пожалуйста, инициализируйте Auth перед использованием других SDK Firebase.",
    "auth/email-already-in-use": "Этот email уже используется другой учетной записью.",
    "auth/emulator-config-failed": "Инициализация Auth уже использовалась для сетевого запроса. Auth больше не может быть настроен для использования эмулятора. Попробуйте вызвать 'connectAuthEmulator()' раньше.",
    "auth/expired-action-code": "Код действия истек.",
    "auth/internal-error": "Произошла внутренняя ошибка.",
    "auth/invalid-app-id": "Идентификатор мобильного приложения не зарегистрирован для текущего проекта.",
    "auth/invalid-user-token": "Учётные данные пользователя недействительны для этого проекта. Это может произойти, если токен пользователя был изменен или пользователь не связан с проектом, связанным с этим API-ключом.",
    "auth/invalid-auth-event": "Произошла внутренняя ошибка аутентификации.",
    "auth/invalid-api-key": "Ваш API-ключ недействителен. Пожалуйста, проверьте его правильность.",
    "auth/invalid-cert-hash": "Предоставленный хеш сертификата SHA-1 недействителен.",
    "auth/invalid-credential": "Предоставленные учетные данные неправильны или истекли.",
    "auth/invalid-message-payload": "Шаблон письма содержит недопустимые символы. Пожалуйста, исправьте это в разделе шаблонов электронных писем Firebase Console.",
    "auth/unauthorized-domain": "Этот домен не авторизован для OAuth операций для вашего проекта Firebase. Отредактируйте список авторизованных доменов в Firebase Console.",
    "auth/invalid-action-code": "Код действия недействителен. Это может произойти, если код неправильный, истек или уже был использован.",
    "auth/invalid-persistence-type": "Указанный тип хранения недействителен. Он может быть только 'local', 'session' или 'none'.",
    "auth/invalid-provider-id": "Указанный идентификатор провайдера недействителен.",
    "auth/invalid-recipient-email": "Адрес электронной почты получателя недействителен.",
    "auth/invalid-sender": "Шаблон письма содержит недействительный email отправителя или имя. Пожалуйста, исправьте это в разделе шаблонов электронных писем Firebase Console.",
    "auth/auth-domain-config-required": "Убедитесь, что вы указали authDomain при вызове firebase.initializeApp(), следуя инструкциям в Firebase Console.",
    "auth/app-deleted": "Этот экземпляр FirebaseApp был удален.",
    "auth/account-exists-with-different-credential": "Аккаунт с этим email уже существует, но с другими учетными данными. Войдите с помощью провайдера, связанного с этим email.",
    "auth/network-request-failed": "Произошла ошибка сети (например, тайм-аут, прерванное соединение или недоступный хост).",
    "auth/no-auth-event": "Произошла внутренняя ошибка аутентификации.",
    "auth/no-such-provider": "Пользователь не был связан с учетной записью с указанным провайдером.",
    "auth/null-user": "Передан объект пользователя со значением null, хотя требуется непустой объект пользователя.",
    "auth/operation-not-allowed": "Этот метод входа отключен для этого проекта Firebase. Включите его в консоли Firebase на вкладке методов входа в разделе Auth.",
    "auth/operation-not-supported-in-this-environment": "Эта операция не поддерживается в текущей среде приложения. 'location.protocol' должен быть http, https или chrome-extension, а веб-хранилище должно быть включено.",
    "auth/quota-exceeded": "Квота проекта на эту операцию превышена.",
    "auth/redirect-cancelled-by-user": "Операция перенаправления была отменена пользователем до завершения.",
    "auth/redirect-operation-pending": "Операция перенаправления уже ожидает выполнения.",
    "auth/rejected-credential": "Запрос содержит неправильные или несовпадающие учетные данные.",
    "auth/too-many-requests": "Слишком много попыток входа. Пожалуйста, попробуйте снова позже.",
    "auth/claims-too-large": "Предоставленные данные для пользовательских требований слишком велики. Убедитесь, что размер не превышает 1000 байт.",
    "auth/invalid-claims": "Предоставленные пользовательские требования недействительны. Проверьте формат и значения.",
    "auth/invalid-creation-time": "Время создания должно быть действительной датой в формате UTC.",
    "auth/invalid-disabled-field": "Поле 'disabled' должно быть значением true или false.",
    "auth/invalid-email-verified": "Поле 'emailVerified' должно быть значением true или false.",
    "auth/invalid-hash-algorithm": "Алгоритм хэширования должен быть одним из поддерживаемых типов.",
    "auth/invalid-hash-block-size": "Размер блока для хэширования должен быть действительным числом.",
    "auth/invalid-hash-derived-key-length": "Длина ключа для хэширования должна быть действительным числом.",
    "auth/invalid-hash-key": "Ключ хэширования должен быть действительным буфером байтов.",
    "auth/invalid-hash-memory-cost": "Стоимость памяти для хэширования должна быть действительным числом.",
    "auth/invalid-hash-parallelization": "Фактор параллелизации для хэширования должен быть действительным числом.",
    "auth/invalid-hash-rounds": "Количество раундов для хэширования должно быть действительным числом.",
    "auth/invalid-hash-salt-separator": "Разделитель соли для хэширования должен быть действительным буфером байтов.",
    "auth/invalid-password-hash": "Хэш пароля должен быть действительным буфером байтов.",
    "auth/invalid-password-salt": "Соль для пароля должна быть действительным буфером байтов.",
    "auth/invalid-photo-url": "Предоставленный URL для фотографии недействителен. Он должен быть правильным URL-форматом.",
    "auth/invalid-provider-data": "Данные провайдера должны быть действительным списком объектов информации о пользователе.",
    "auth/invalid-oauth-responsetype": "Вы должны установить только один тип ответа OAuth в значение true.",
    "auth/invalid-user-import": "Запись пользователя, которую вы пытаетесь импортировать, недействительна.",
    "auth/maximum-user-count-exceeded": "Вы превысили максимальное количество пользователей, разрешенное для импорта.",
    "auth/missing-hash-algorithm": "Необходимо предоставить алгоритм хэширования и его параметры для импорта пользователей с хэшами паролей.",
    "auth/missing-oauth-client-secret": "Необходимо предоставить секрет клиента OAuth для включения потока кода OIDC.",
    "auth/phone-number-already-exists": "Этот номер телефона уже связан с другим пользователем. Каждый номер телефона должен быть уникальным.",
    "auth/reserved-claims": "Некоторые предоставленные вами пользовательские требования зарезервированы для системного использования. Избегайте использования специфичных для OIDC требований в качестве пользовательских ключей.",
    "auth/captcha-check-failed": "Токен reCAPTCHA недействителен, истек или домен не соответствует разрешенным доменам.",
    "auth/code-expired": "Код подтверждения истек. Пожалуйста, запросите новый код и попробуйте снова.",
    "auth/cordova-not-ready": "Фреймворк Cordova еще не готов.",
    "auth/dynamic-link-not-activated": "Пожалуйста, активируйте Динамические ссылки в консоли Firebase и согласитесь с условиями использования.",
    "auth/email-change-needs-verification": "Пользователи с многофакторной аутентификацией должны иметь проверенный email.",
    "auth/cancelled-popup-request": "Операция была отменена из-за открытия другого всплывающего окна.",
    "auth/invalid-app-credential": "Запрос на подтверждение номера телефона содержит недействительный проверяющий приложения или токен reCAPTCHA недействителен или истек.",
    "auth/invalid-verification-code": "Код подтверждения по SMS неверен или истек. Пожалуйста, отправьте код снова и убедитесь, что вы используете правильный код.",
    "auth/invalid-continue-uri": "Предоставленный URL для продолжения недействителен.",
    "auth/invalid-cordova-configuration": "Установите необходимые плагины Cordova для OAuth-аутентификации: cordova-plugin-buildinfo, cordova-universal-links-plugin, cordova-plugin-browsertab, cordova-plugin-inappbrowser и cordova-plugin-customurlscheme.",
    "auth/invalid-custom-token": "Пользовательский токен имеет неправильный формат. Пожалуйста, обратитесь к документации для правильного форматирования.",
    "auth/invalid-dynamic-link-domain": "Предоставленный домен динамической ссылки не настроен или не авторизован для вашего проекта.",
    "auth/invalid-emulator-scheme": "URL эмулятора должен начинаться с 'http://' или 'https://'.",
    "auth/invalid-multi-factor-session": "Необходимо предоставить доказательства успешного входа с первым фактором.",
    "auth/invalid-oauth-provider": "Поддерживаются только провайдеры OAuth для этой операции. EmailAuthProvider не поддерживается.",
    "auth/invalid-oauth-client-id": "Идентификатор клиента OAuth недействителен или не соответствует ключу API.",
    "auth/invalid-phone-number": "Формат номера телефона неверен. Пожалуйста, используйте формат E.164: [+][код страны][номер абонента].",
    "auth/invalid-verification-id": "Используемый идентификатор подтверждения недействителен.",
    "auth/invalid-tenant-id": "Идентификатор арендатора для экземпляра Auth недействителен.",
    "auth/missing-android-pkg-name": "Необходимо указать название пакета Android, если приложение должно быть установлено.",
    "auth/missing-app-credential": "Запрос на подтверждение номера телефона не содержит проверяющего приложения. Пожалуйста, предоставьте токен reCAPTCHA.",
    "auth/missing-verification-code": "Учетные данные аутентификации по телефону были созданы без кода подтверждения.",
    "auth/missing-continue-uri": "В запросе требуется указать URL для продолжения.",
    "auth/missing-iframe-start": "Произошла внутренняя ошибка.",
    "auth/missing-ios-bundle-id": "Необходим идентификатор пакета iOS, если предоставлен идентификатор App Store.",
    "auth/missing-or-invalid-nonce": "Запрос отсутствует или содержит недействительный nonce. Убедитесь, что nonce соответствует хэшированному nonce в ID токене.",
    "auth/missing-multi-factor-info": "Необходимо предоставить информацию о втором факторе аутентификации.",
    "auth/missing-multi-factor-session": "Отсутствует доказательство успешного входа с первым фактором.",
    "auth/missing-phone-number": "Пожалуйста, укажите номер телефона для отправки кодов подтверждения.",
    "auth/missing-verification-id": "Учетные данные аутентификации по телефону были созданы без идентификатора подтверждения.",
    "auth/multi-factor-info-not-found": "Не найдено соответствующее значение второго фактора для предоставленного идентификатора.",
    "auth/multi-factor-auth-required": "Необходимо подтвердить наличие второго фактора для завершения входа.",
    "auth/popup-blocked": "Всплывающее окно не может быть открыто. Возможно, оно было заблокировано вашим браузером.",
    "auth/popup-closed-by-user": "Всплывающее окно было закрыто пользователем до завершения операции.",
    "auth/provider-already-linked": "Пользователь может быть связан только с одной личностью для данного провайдера.",
    "auth/second-factor-already-in-use": "Этот второй фактор уже привязан к аккаунту.",
    "auth/maximum-second-factor-count-exceeded": "Превышено максимальное количество вторых факторов для пользователя.",
    "auth/tenant-id-mismatch": "Предоставленный идентификатор арендатора не совпадает с идентификатором арендатора экземпляра Auth.",
    "auth/unauthorized-continue-uri": "Домен URL для продолжения не разрешен. Пожалуйста, добавьте его в белый список в консоли Firebase.",
    "auth/unsupported-first-factor": "Необходимо войти с поддерживаемым первым фактором перед добавлением второго фактора или использованием многофакторного входа.",
    "auth/unsupported-persistence-type": "Указанный тип сохранения не поддерживается в текущей среде.",
    "auth/unsupported-tenant-operation": "Эта операция не поддерживается в многопользовательском контексте.",
    "auth/unverified-email": "Для завершения операции требуется проверенный email.",
    "auth/user-cancelled": "Пользователь не предоставил необходимые разрешения для вашего приложения.",
    "auth/user-disabled": "Учетная запись пользователя была отключена администратором.",
    "auth/user-mismatch": "Предоставленные учетные данные не соответствуют вошедшему пользователю.",
    "auth/web-storage-unsupported": "Ваш браузер не поддерживает веб-хранилище или сторонние файлы cookie могут быть отключены.",
    "auth/already-initialized": "initializeAuth() был вызван с разными параметрами. Пожалуйста, используйте те же параметры или вызовите getAuth(), чтобы использовать существующий экземпляр."
  }
}
